In [2]:
import pandas as pd
df = pd.DataFrame({'X': ['B', 'B', 'A', 'A'],
                   'Y': [1, 2, 3, 4]})

# using groupby function
df.groupby('X').sum()

   Y
X
A  7
B  3

In [3]:
df.groupby('X', sort = False).sum()

   Y
X
B  3
A  7

In [4]:
data = {'Name':['Elle', 'Chloe', 'Noah', 'Marco',  
                 'Lee', 'Elle', 'Rachel', 'Noah'],  
        'Age':[17, 19, 18, 17,  
               22, 18, 21, 20]}   
  
df = pd.DataFrame(data) 
print(df)
df.groupby(['Name']).sum()

     Name  Age
0    Elle   17
1   Chloe   19
2    Noah   18
3   Marco   17
4     Lee   22
5    Elle   18
6  Rachel   21
7    Noah   20

        Age
Name
Chloe    19
Elle     35
Lee      22
Marco    17
Noah     38
Rachel   21

In [5]:
df.groupby(['Name'],sort=True).sum()

        Age
Name
Chloe    19
Elle     35
Lee      22
Marco    17
Noah     38
Rachel   21

In [6]:

import pandas as pd
  
  
df = pd.DataFrame([('Bike', 'Kawasaki', 186),
                   ('Bike', 'Ducati Panigale', 202),
                   ('Car', 'Bugatti Chiron', 304), 
                   ('Car', 'Jaguar XJ220', 210),
                   ('Bike', 'Lightning LS-218', 218), 
                   ('Car', 'Hennessey Venom GT', 270),
                   ('Bike', 'BMW S1000RR', 188)], 
                  columns =('Type', 'Name', 'top_speed(mph)'))
  
df.sort_values(by=['top_speed(mph)']) #Sorting dataframe

   Type                Name  top_speed(mph)
0  Bike            Kawasaki             186
6  Bike         BMW S1000RR             188
1  Bike     Ducati Panigale             202
3   Car        Jaguar XJ220             210
4  Bike    Lightning LS-218             218
5   Car  Hennessey Venom GT             270
2   Car      Bugatti Chiron             304

In [7]:
#grouped = df.groupby(['Type'])['top_speed(mph)'].sum()
grouped = df.groupby(['Type'])['top_speed(mph)'].nlargest()
print(grouped)

Type
Bike  4    218
      1    202
      6    188
      0    186
Car   2    304
      5    270
      3    210
Name: top_speed(mph), dtype: int64

In [8]:

# importing pandas as pd
import pandas as pd
  
# Creating the dataframe 
df = pd.read_csv("nba.csv")
  
# Print the dataframe
#df=df.groupby('Team')
#df.get_group('Boston Celtics')
fg = df.groupby(['Team', 'Position'])
print(fg)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000025ABE5DD540>

In [9]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)
df

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0